<script>
  import Section from '$lib/components/Section.svelte'
</script>

<Section>
  <div class="grid gap-[6rem]">
    <div>
      <h3>개인정보취급방침</h3>
      <!-- <p class="fg-sub text24-500"></p> -->
    </div>
  </div>
</Section>
<Section>
  <div class="flex flex-col gap-6">
    (주)툴젠(이하 "회사"라 함)는 이용자(또는 정보주체, 이하 “이용자”라 함)의 개인정보를 중요시 하며, 「정보통신망
    이용촉진 및 정보보호 등에 관한 법률」, 「개인정보 보호법」등 제반 법령상의 개인정보보호 규정을 준수하고, 개인정보
    처리방침을 제정하여 이용자의 권익보호에 최선을 다하고 있습니다. 회사는 개인정보 처리방침을 통해 회사가 이용자로부터
    수집하는 개인정보의 항목 및 처리목적, 처리 및 보유기간, 이용자의 권리 및 행사방법, 안전성 확보조치 등 회사의
    개인정보 처리에 관한 정책을 알려 드립니다. 회사는 관련 법령의 개정 및 정책의 변경, 회사의 내부방침의 변경 등에 따라
    개인정보 처리방침 내용의 수정, 삭제 및 추가 등 변경이 발생하는 경우에는 이용자가 쉽게 확인할 수 있도록 회사
    홈페이지(toolgen.com)를 통해 공지하도록 하겠습니다. 회사의 개인정보처리방침은 다음의 내용을 담고 있습니다.

    <span style="font-weight:bold;">1. 개인정보의 수집·이용 목적</span>
    회사는 개인정보를 다음의 목적을 위하여 수집·이용합니다.<br />수집한 개인정보는 다음의 목적 이외의 용도로는 이용되지
    않으며, 이용 목적이 변경되는 경우 사전동의를 구하는 등 법령상 필요한 조치를 이행할 예정입니다.
    <table>
      <thead>
        <th>라이센싱 문의</th>
        <th>채용 문의</th>
      </thead>
      <tbody>
        <tr>
          <td>이용자 문의사항 확인, 답변 회신</td>
          <td>지원자의 당사 채용 전형 진행</td>
        </tr>
      </tbody>
    </table>

    <span style="font-weight:bold;">2. 수집하는 개인정보의 항목 및 수집방법</span>
    ① 라이센싱 문의 가. 수집항목
    <table>
      <colgroup>
        <col style="width:25%" />
        <col style="width:15%" />
        <col style="width:60%" />
      </colgroup>
      <thead>
        <th>카테고리</th>
        <th colspan="2">수집항목</th>
      </thead>
      <tbody>
        <tr>
          <td rowspan="2">라이센싱 문의</td>
          <td class="title">필수</td>
          <td>성명, 이메일, 국가, 회사명, 관심분야</td>
        </tr>
        <tr>
          <td class="title">선택</td>
          <td>문의사항</td>
        </tr>
      </tbody>
    </table>
    - 서비스 이용과정에서 아래와 같은 정보들이 생성되어 수집될 수 있습니다. - 접속로그, 쿠키 나. 수집방법 - 홈페이지 내 '라이센싱
    문의'을 통한 수집 - 생성정보 수집 툴을 통한 수집<br class="m" />(접속로그, 쿠키 등의 경우) ② 채용 지원 가. 수집항목
    <table>
      <colgroup>
        <col style="width:25%" />
        <col style="width:15%" />
        <col style="width:60%" />
      </colgroup>
      <thead>
        <th>카테고리</th>
        <th colspan="2">수집항목</th>
      </thead>
      <tbody>
        <tr>
          <td rowspan="2">입사지원서 제출</td>
          <td>필수</td>
          <td
            >성명 (국문, 영문), 생년월일, 주소, 휴대전화번호, 이메일, 학력사항 (학교, 전공, 입학년월, 졸업년월,
            졸업구분, 소재지), 경력사항 (근무기간, 근무처, 직위, 직무, 주요업무), 경력회사내용, 어학사항, 특기사항
            (병역구분, 면제사유, 군별, 보훈여부)</td
          >
        </tr>
        <tr>
          <td>선택</td>
          <td>자격사항 (특수자격 및 면허) 이력서, 프로필 링크 석, 박사과정 중 연구경력</td>
        </tr>
      </tbody>
    </table>
    나. 수집방법 - 당사 이메일 ( recruit@toolgen.com )

    <span style="font-weight:bold;">3. 개인정보 보유 및 이용 기간</span>
    ① 원칙적으로, 회사는 수집된 개인정보를 개인정보 수집 및 이용목적이 달성된 후에는 지체 없이 파기합니다. <br />단,
    관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령 등에서 정한 일정한 기간 동안 회원정보를 보관합니다.
    ② 개인정보별 보유기간, 파기의 절차 및 방법은 다음과 같습니다. 가. 보유기간
    <table>
      <thead>
        <th width="50%">개인정보 종류</th>
        <th width="50%">보유기간</th>
      </thead>
      <tbody>
        <tr>
          <td>고객문의 응대를 위하여 수집된 개인정보</td>
          <td>고객 응대 답변 완료 후 즉시 (5일 이내) 파기</td>
        </tr>
        <tr>
          <td>채용전형 진행을 위하여 본 홈페이지 및 이메일을 통해 수집된 개인정보</td>
          <td>전형결과 발표 후 즉시 (5일 이내) 파기</td>
        </tr>
      </tbody>
    </table>
    나. 파기절차 - 회사는 개인정보 수집∙이용 목적이 달성된 후 지체 없이 파기합니다. 다만, 관련 법령에 따라 해당 개인정보를
    일정기간 동안 보관하여야 하는 경우에는 이를 별도로 분리 보관한 후 파기합니다. 다. 파기방법 - 회사는 전자적 파일 형태로
    기록․저장된 개인정보는 기록을 재생할 수 없도록 파기하며, 종이 문서에 기록․저장된 개인정보는 분쇄기로 분쇄하거나 소각하여
    파기합니다.

    <span style="font-weight:bold;">4. 개인정보 제3자 제공에 관한 사항</span>
    ① 회사는 채용 전형 진행 단계에서 다음과 같이 개인정보를 제3자에게 제공하고 있습니다. 가. 기재하신 학력에 해당되는 교육기관
    - 제공받는 자: 기재하신 학력에 해당되는 교육기관 - 제공하는 개인정보: 성명, 생년월일, 학력사항(학교명, 전공명, 입학년도,
    졸업년도 등) - 개인정보 제공목적: 학위 검증 - 개인정보 보유 및 이용기간: 학위 검증 및 인재채용 종료 후 즉시 파기 나.
    평판 조회(Reference Check) - 제공받는 자: 입사지원자가 근무한 경력이 있는 회사 및 평판조회 전문 회사 - 제공하는 개인정보:
    성명 - 개인정보 제공목적: 평판 조회 - 개인정보 보유 및 이용기간: 평판 조회 및 인재채용 종료 후 즉시 파기 ② 회사는 수집된
    이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다. 다만, 아래의 경우에는 예외로 합니다. - 이용자가 사전에 동의한
    경우 - 법률에 특별한 규정이 있거나 법령상 의무를 준수하기 위하여 불가피한 경우, 정보주체 또는 그 법정대리인이 의사표시를
    할 수 없는 상태에 있거나 주소불명 등으로 사전 동의를 받을 수 없는 경우로써 명백히 정보주체 또는 제3자의 급박한 생명,
    신체, 재산의 이익을 위하여 필요하다고 인정되는 경우 (개인정보 수집목적 범위에 한함) ③ 이용자는 개인정보의 제3자 제공에
    대하여 거부할 권리가 있으며, 동의를 거부하는 경우 서비스 이용 등에 제한이 있을 수 있습니다.

    <span style="font-weight:bold;">5. 개인정보 자동 수집 장치의 설치·운영 및 그 거부에 관한 사항</span>
    회사는 이용자의 정보를 수시로 저장하고 찾아내는 ‘쿠키(cookie)’를 운영합니다. ① 쿠키 운영 목적 이용자들의 웹사이트 방문
    및 이용형태, 이용자 규모 등을 파악하여 이용자에게 최적화된 정보의 제공을 목적으로 운영합니다 ② 쿠키 설정, 확인 및 거부
    방법 이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나,
    쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다. 단, 이용자가 쿠키 설치를 거부하였을
    경우 서비스 제공에 어려움이 있을 수 있습니다. - 쿠키설정 방법
    <table>
      <thead>
        <th style="width:20%">유형</th>
        <th>설정방법</th>
      </thead>
      <tbody>
        <tr>
          <td>인터넷 익스플로어</td>
          <td>브라우저 상단의 도구 &gt; 인터넷 옵션 &gt; 개인정보</td>
        </tr>
        <tr>
          <td>크롬</td>
          <td>브라우저 우측 상단 &gt; 맞춤 설정 및 제어 &gt; 설정 &gt; 개인정보 및 보안 &gt; 인터넷 사용 기록 삭제</td>
        </tr>
        <tr>
          <td>사파리</td>
          <td>설정 &gt; Safari &gt; 방문 기록 및 웹 사이트 데이터 지우기</td>
        </tr>
        <tr>
          <td>파이어폭스</td>
          <td
            >브라우저 우측 상단 &gt; 설정 &gt; 개인 정보 및 보안 &gt; 쿠키 및 사이트 데이터 삭제 &gt; 데이터 삭제 &gt;
            쿠키 및 사이트 데이터 &amp; 캐시된 웹 콘텐츠 &gt; 삭제</td
          >
        </tr>
        <tr>
          <td>네이버웨일</td>
          <td
            >브라우저 우측 상단 &gt; 세 점 아이콘 &gt; 설정 &gt; 개인정보 보호 &gt; 인터넷 사용 기록 삭제 &gt; 데이터
            삭제</td
          >
        </tr>
        <tr>
          <td>Microsoft Edge</td>
          <td
            >브라우저 우측 상단 &gt; 세 점 아이콘 &gt; 설정 &gt; 개인 정보 및 서비스 &gt; 검색 데이터 지우기 &gt; 지울
            항목 선택 &gt; 지금 지우기</td
          >
        </tr>
      </tbody>
    </table>
    쿠키의 저장을 거부하는 옵션을 선택하시는 경우에는 서비스 이용(로그인이 필요한 서비스 이용 불가 등) 불편이 야기될 수 있습니다.

    <span style="font-weight:bold;">6. 개인정보 관리책임자 및 관련 고충사항 처리부서 등에 관한 사항</span>
    회사는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만사항을 처리하기 위하여 다음과 같이 개인정보 관리책임자 및 담당자를
    지정·운영하고 있습니다. 개인정보보호 및 관리와 관련한 문의사항이 있을 시 아래 담당자에게 연락하시면 신속하고 충분한 답변을
    드릴 것입니다.
    <table>
      <thead>
        <th>개인정보 보호, 관리 책임 및 고충사항 처리 담당자</th>
      </thead>
      <tbody>
        <tr>
          <td>
            성명 : 경영지원본부 이형규 이사<br />
            연락처 : 02-873-8168<br />
            이메일 : info@toolgen.com
          </td>
        </tr>
      </tbody>
    </table>

    <span style="font-weight:bold;">7. 권익침해 구제 방법</span>
    이용자는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보보호책임자 혹은 담당부서로 신고하실
    수 있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다. 기타 개인정보침해에 대한 신고나
    상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다. - KISA 개인정보 침해신고센터 (privacy.kisa.or.kr, 국번없이
    118) - 개인정보 분쟁조정위원회 (kopico.go.kr, 1833-6972) - 대검찰청 사이버수사과 (spo.go.kr, 국번없이 1301) - 경찰청
    사이버안전국 (cyberbureau.police.go.kr, 국번없이 182)

    <span style="font-weight:bold;">8. 개인정보 처리방침 변경에 관한 사항</span>
    이 개인정보 처리방침은 2022. 05. 16부터 적용됩니다. 법령 및 정책 등의 변경에 따라 본 개인정보 처리방침이 변경되는 경우에는
    웹사이트 공지사항 및 별도의 창을 통해 해당 내용을 공지하겠습니다.
  </div>
</Section>
