<script>
    import {popup} from "$lib/screen";
    import Pagination from "./Pagination.svelte"
    import Table from "./Table.svelte"
</script>
{#if $popup}
<div class="overlay" tabindex="0" role="button" on:click|self={()=>{popup.set(false)}} on:keydown|self={(e) => {if (e.key === 'Enter' || e.key === ' ') {popup.set(false)}}}>
    <div class="panel">
        <a class="clean exit pc" href="/" on:click|preventDefault={()=>{popup.set(false)}}>
            <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect x="0.5" y="0.5" width="36" height="36" rx="18" fill="white" fill-opacity="0.2"/>
                <path fill-rule="evenodd" clip-rule="evenodd" d="M12.6953 23.3619C12.4349 23.6223 12.4349 24.0444 12.6953 24.3047C12.9556 24.5651 13.3777 24.5651 13.6381 24.3047L18.5 19.4428L23.3619 24.3047C23.6223 24.5651 24.0444 24.5651 24.3047 24.3047C24.5651 24.0444 24.5651 23.6223 24.3047 23.3619L19.4428 18.5L24.3047 13.6381C24.5651 13.3777 24.5651 12.9556 24.3047 12.6953C24.0444 12.4349 23.6223 12.4349 23.3619 12.6953L18.5 17.5572L13.6381 12.6953C13.3777 12.4349 12.9556 12.4349 12.6953 12.6953C12.4349 12.9556 12.4349 13.3777 12.6953 13.6381L17.5572 18.5L12.6953 23.3619Z" fill="white"/>
            </svg>                 
        </a>
        <a class="clean exit mob" href="/" on:click|preventDefault={()=>{popup.set(false)}}>
            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M18.5858 20.0001L10.293 28.293L11.7072 29.7072L20 21.4143L28.293 29.7073L29.7072 28.2931L21.4142 20.0001L29.7072 11.7072L28.293 10.293L20 18.5859L11.7072 10.2931L10.293 11.7073L18.5858 20.0001Z" fill="black"/>
            </svg>    
        </a>
        {#if $popup.type == "panel"}
        <svg class="absolute right-0 bottom-0" width="280" height="311" viewBox="0 0 280 311" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g opacity="0.2" clip-path="url(#clip0_1271_51615)">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M109.878 120.625L109.897 120.63V120.605L109.878 120.625ZM109.878 120.625L87.5625 114.627L81.5934 92.1641L6.35723 167.833C-1.45241 175.687 -1.45241 188.445 6.35723 196.299C14.1669 204.154 26.8513 204.154 34.6609 196.299L109.878 120.625ZM104.971 199.6C98.6789 193.296 95.6943 185.417 96.6892 179.463L166.876 108.873C174.686 101.018 187.371 101.018 195.18 108.873C202.99 116.727 202.99 129.485 195.18 137.339L124.993 207.93C119.074 208.93 111.239 205.904 104.971 199.6ZM228.36 206.454L228.34 206.448L228.36 206.429V206.454ZM228.34 206.448L153.124 282.122C145.314 289.977 132.63 289.977 124.82 282.122C117.01 274.268 117.01 261.51 124.82 253.656L200.056 177.987L206.025 200.45L228.34 206.448ZM223.411 285.425C217.118 279.122 214.133 271.242 215.128 265.289L285.316 194.698C293.125 186.843 305.81 186.843 313.619 194.698C321.429 202.553 321.429 215.31 313.619 223.164L243.432 293.755C237.513 294.756 229.678 291.729 223.411 285.425Z" fill="#337DD9"/>
            <path fill-rule="evenodd" clip-rule="evenodd" d="M102.658 99.4446L96.6886 76.9816L166.876 6.3909C174.686 -1.46363 187.37 -1.46363 195.18 6.3909C202.989 14.2454 202.989 27.0028 195.18 34.8573L124.992 105.448L102.658 99.4446ZM89.8756 214.786C96.1432 221.115 103.978 224.117 109.897 223.116L34.6609 298.785C26.8513 306.639 14.1669 306.639 6.35723 298.785C-1.45241 290.93 -1.45241 278.173 6.35723 270.319L81.5934 194.65C80.5985 200.603 83.608 208.483 89.8756 214.786ZM215.151 162.807L221.121 185.27L243.455 191.273L313.642 120.683C321.452 112.828 321.452 100.071 313.642 92.2163C305.833 84.3617 293.148 84.3617 285.339 92.2163L215.151 162.807ZM208.315 300.609C214.582 306.938 222.417 309.94 228.336 308.939L153.1 384.608C145.29 392.462 132.606 392.462 124.796 384.608C116.987 376.753 116.987 363.996 124.796 356.141L200.033 280.473C199.038 286.426 202.047 294.306 208.315 300.609Z" fill="#337DD9"/>
            </g>
            <defs>
            <clipPath id="clip0_1271_51615">
            <rect width="319" height="390" fill="white" transform="translate(0.5 0.5)"/>
            </clipPath>
            </defs>
        </svg> 
        <div class="content">
            <div class="grid gap-4">
                <div class="grid gap-2">
                    <h3 class="text24-700 color-yellow">TGT-001 | Charcot-Marie-Tooth Disease</h3>
                    <p class="text14-400 fg-sub">CNS / PNS(신경)</p>
                </div>
                   
                <div class="grid em:gap-4">
                    <p>
                        <b>CMT1A 질병</b><br>
                        전세계에 100 만명 이상의 환자가 있는 CMT1A는 유전자 중복에 의해 PMP22 유전자가 과발현되고 이로 인해 말초신경(PNS)의 탈수초화 (dem-yelination)가 일어나 생기는 질병으로 다른 많은 유전병처럼 아직 근본적인 치료법이 없기 때문에 의료적 미충족수요가 높습니다.
                    </p>
                    <p>
                       <b>툴젠 TGT-001 프로그램</b><br>
                       TGT-001은 PMP22 유전자 중복에 의해 발생하는 유전질병인 CMT1A에 대한 유전자교정 치료 프로그램입니다. 툴젠은 유전자교정을 이용한 PMP22 유전자 발현 조절 기술을 바탕으로 CMT1A의 근본 원인을 교정하여 완치를 목표로 한 TGT-001을 개발하고 있으며, 현재 동물 실험을 통해 치료 전략에 대한 검증을 마쳤습니다.
                    </p>
                </div>
            </div>
            </div>
            {:else if $popup.type == "form"}
            <svg class="absolute right-0 bottom-0" width="280" height="311" viewBox="0 0 280 311" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g opacity="0.2" clip-path="url(#clip0_1271_51615)">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M109.878 120.625L109.897 120.63V120.605L109.878 120.625ZM109.878 120.625L87.5625 114.627L81.5934 92.1641L6.35723 167.833C-1.45241 175.687 -1.45241 188.445 6.35723 196.299C14.1669 204.154 26.8513 204.154 34.6609 196.299L109.878 120.625ZM104.971 199.6C98.6789 193.296 95.6943 185.417 96.6892 179.463L166.876 108.873C174.686 101.018 187.371 101.018 195.18 108.873C202.99 116.727 202.99 129.485 195.18 137.339L124.993 207.93C119.074 208.93 111.239 205.904 104.971 199.6ZM228.36 206.454L228.34 206.448L228.36 206.429V206.454ZM228.34 206.448L153.124 282.122C145.314 289.977 132.63 289.977 124.82 282.122C117.01 274.268 117.01 261.51 124.82 253.656L200.056 177.987L206.025 200.45L228.34 206.448ZM223.411 285.425C217.118 279.122 214.133 271.242 215.128 265.289L285.316 194.698C293.125 186.843 305.81 186.843 313.619 194.698C321.429 202.553 321.429 215.31 313.619 223.164L243.432 293.755C237.513 294.756 229.678 291.729 223.411 285.425Z" fill="#337DD9"/>
                <path fill-rule="evenodd" clip-rule="evenodd" d="M102.658 99.4446L96.6886 76.9816L166.876 6.3909C174.686 -1.46363 187.37 -1.46363 195.18 6.3909C202.989 14.2454 202.989 27.0028 195.18 34.8573L124.992 105.448L102.658 99.4446ZM89.8756 214.786C96.1432 221.115 103.978 224.117 109.897 223.116L34.6609 298.785C26.8513 306.639 14.1669 306.639 6.35723 298.785C-1.45241 290.93 -1.45241 278.173 6.35723 270.319L81.5934 194.65C80.5985 200.603 83.608 208.483 89.8756 214.786ZM215.151 162.807L221.121 185.27L243.455 191.273L313.642 120.683C321.452 112.828 321.452 100.071 313.642 92.2163C305.833 84.3617 293.148 84.3617 285.339 92.2163L215.151 162.807ZM208.315 300.609C214.582 306.938 222.417 309.94 228.336 308.939L153.1 384.608C145.29 392.462 132.606 392.462 124.796 384.608C116.987 376.753 116.987 363.996 124.796 356.141L200.033 280.473C199.038 286.426 202.047 294.306 208.315 300.609Z" fill="#337DD9"/>
                </g>
                <defs>
                <clipPath id="clip0_1271_51615">
                <rect width="319" height="390" fill="white" transform="translate(0.5 0.5)"/>
                </clipPath>
                </defs>
            </svg> 
        <div class="content">
            <div class="grid gap-6">
                <div class="grid gap-1">
                    <p class="text14-400 fg-sub">Interest in ToolGen's</p>
                    <p class="text18-700">[Platform : Diagnosis (새로운 사업 확장 기회)]</p>
                    <p>툴젠의 기능향상 CRISPR-Cas9및 안정성 평가 기술은 파트너사의 안정적인 CRISPR-Cas9의 활용을 통한 빠른 사업 확장이 가능하도록 최선을 다하고 있습니다. 파트너쉽에 대해 문의주시면 자세히 설명드리겠습니다.</p>
                </div>
                <div class="grid gap-4">
                    <div class="grid gap-2">
                        <p class="text14-700">성명 <span class="fg-blue">*</span></p>
                        <input type="text"/>
                    </div>
                    <div class="grid gap-2">
                        <p class="text14-700">단체 <span class="fg-blue">*</span></p>
                        <input type="text"/>
                    </div>
                    <div class="grid gap-2">
                        <p class="text14-700">이메일 <span class="fg-blue">*</span></p>
                        <input type="text"/>
                    </div>
                    <div class="grid gap-2">
                        <p class="text14-700">연락처 <span class="text14-400 fg-sub">(선택)</span></p>
                        <input type="text"/>
                    </div>
                    <div class="grid gap-2">
                        <p class="text14-700">문의사항 <span class="fg-blue">*</span></p>
                        <textarea rows="5"></textarea>
                    </div>
                    <div>
                        <button class="fill">보내기</button>
                    </div>
                </div>
            </div>
            </div>
            {:else if $popup.type == "profile"}
            <div class="fill-mint pop-profile flex text-white">
                <div class="thumb flex-[5] bg-white">
                    <img class="w-full h-full block object-cover" src="/images/people-2.png"/>
                </div>
                <div class="desc p-6 grid gap-6 flex-[6]">
                    <div class="flex">
                        <div>
                            <p class="text16-700">이병화</p>
                            <p class="text14-400">총괄</p>
                        </div>
                    </div>
                    <div class="overflow-y-auto leading-7 h-[100%] max-h-[300px]">
                        <p class="body14-400">1991년 한국장기신용은행(국민은행과 합병)에 입사하여 2000년 ㈜마크로젠에 입사하기 전까지 은행에서 약 10년간 기업여신 및 심사 등 다양한 금융업무를 경험하였습니다.
                            2000년 바이오 기업인 마크로젠에 합류하여 자금, IR, 공시, 경영관리, 영업총괄 등 다양한 업무를 경험한 후 대표이사로서 경영을 총괄하였으며, 2010년까지 마크로젠의 미국법인, 일본법인, 유럽지사 등을 설립하고 글로벌 유전자분석 비즈니스를 전개함으로써 마크로젠이 세계적인 유전체분석 및 정밀의학회사로 성장하는 데 주도적으로 기여하였습니다.
                            2011년부터는 ㈜엠지메드로 자리를 옮겨 대표이사를 역임하면서 분자진단 기술 개발 및 유전자칩을 이용한 질병진단사업을 성공적으로 이끌고, 코스닥시장에 상장시킨 경험도 가지고 있습니다. 금융업에서의 10년, 바이오업계에서 22년의 경험으로 바이오 산업에 대한 깊은 이해는 물론 기업의 재무관리, 리스크관리, 1991년 한국장기신용은행(국민은행과 합병)에 입사하여 2000년 ㈜마크로젠에 입사하기 전까지 은행에서 약 10년간 기업여신 및 심사 등 다양한 금융업무를 경험하였습니다.
                            2000년 바이오 기업인 마크로젠에 합류하여 자금, IR, 공시, 경영관리, 영업총괄 등 다양한 업무를 경험한 후 대표이사로서 경영을 총괄하였으며, 2010년까지 마크로젠의 미국법인, 일본법인, 유럽지사 등을 설립하고 글로벌 유전자분석 비즈니스를 전개함으로써 마크로젠이 세계적인 유전체분석 및 정밀의학회사로 성장하는 데 주도적으로 기여하였습니다.
                            2011년부터는 ㈜엠지메드로 자리를 옮겨 대표이사를 역임하면서 분자진단 기술 개발 및 유전자칩을 이용한 질병진단사업을 성공적으로 이끌고, 코스닥시장에 상장시킨 경험도 가지고 있습니다. 금융업에서의 10년, 바이오업계에서 22년의 경험으로 바이오 산업에 대한 깊은 이해는 물론 기업의 재무관리, 리스크관리, </p>
                    </div>
                </div>
            </div>
            {:else if $popup.type == "pct"}
                <div class="content w-[1080px]">
                    <div class="grid gap-4">
                        <h4>CRISPR-Cas9 응용특허 PCT 출원 리스트</h4>
                        <Table
                            data={[
                                ["국가","출원번호","출원일","현황"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                                ["한국","BR1120150008708-6","2023.01.06","출원"],
                            ]}
                        />
                        <Pagination/>
                    </div>
                </div>
            {/if}
    </div>
</div>
{/if}